app/Controllers/Admin/EstudianteController.php

    public function index()
    {
        $estudiantes = $this->estudiante->orderBy('id', 'ASC')->findAll();
---
SELECT *
FROM `estudiantes`
ORDER BY `id` ASC