app/Controllers/Admin/GrupoController.php

SELECT *
FROM `grupos`
ORDER BY `id` ASC
---
    public function index()
    {

        $data = [
            'grupos'    => $this->grupo->orderBy('id', 'ASC')->findAll()
        ];